{
    "currentevents": [
    {
        "charityName": "NAACP",
        "charityGoal": "The mission of the National Association for the Advancement of Colored People (NAACP) is to secure the political, educational, social, and economic equality of rights in order to eliminate race-based discrimination and ensure the health and well-being of all persons.",
        "charityImage": "https://i.imgur.com/0tzWZS0.png",
        "charityLink": "https://www.naacp.org/"},
    {
        "charityName": "Doctors-Without-Borders",
        "charityGoal": "Médecins Sans Frontières, sometimes rendered in English as Doctors Without Borders, is an international humanitarian medical non-governmental organisation of French origin best known for its projects in conflict zones and in countries affected by endemic diseases.",
        "charityImage": "https://i.imgur.com/g7Zq39S.png",
        "charityLink": "https://www.doctorswithoutborders.org/"},
    {
        "charityName": "Partners-In-Health",
        "charityGoal": "Our mission is to provide a preferential option for the poor in health care. By establishing long-term relationships with sister organizations based in settings of poverty, Partners In Health strives to achieve two overarching goals: to bring the benefits of modern medical science to those most in need of them and to serve as an antidote to despair.",
        "charityImage": "https://i.imgur.com/bZC4S5D.png",
        "charityLink": "https://www.pih.org/"}
    ],
    "environmental": [
    {
        "charityName": "Environmental-Defense-Fund",
        "charityGoal": "We address today's most urgent environmental challenges. Working in partnership with others, we focus where we're best positioned to help, based on our strengths.",
        "charityImage": "https://i.imgur.com/lfXkRji.png",
        "charityLink": "https://www.edf.org/"},
    {
        "charityName": "Environmental-and-Energy-Study-Institute",
        "charityGoal": "Our primary goal is to accelerate the transition to a new, low-emissions economy based on energy efficiency and renewable energy.",
        "charityImage": "https://i.imgur.com/ewuifzh.png",
        "charityLink": "https://www.eesi.org/"},
    {
        "charityName": "National-Forest-Foundation",
        "charityGoal": "The National Forest Foundation, chartered by Congress, engages Americans in community-based and national programs that promote the health and public enjoyment of the 193-million-acre National Forest System, and administers private gifts of funds and land for the benefit of the National Forests.",
        "charityImage": "https://i.imgur.com/nJJoPwi.png",
        "charityLink": "https://www.nationalforests.org/"}
    ],
    "education": [
    {
        "charityName": "Equal-Opportunity-Schools",
        "charityGoal": "Help ensure that students of color and low-income students have equitable access to America’s most academically intense high school programs and succeed at the highest levels.",
        "charityImage": "https://media.glassdoor.com/sqll/1311566/equal-opportunity-schools-squarelogo-1503655750206.png",
        "charityLink": "https://eoschools.org/"}
    ]
}